{"Avoid swimming due to rain; stay safe and wait for clearance.": "Avoid swimming during heavy rainfall due to reduced visibility. Seek shelter during storms or when lightning is present. Be mindful of strong wind gusts that can make the water choppy. If you do swim, wear bright-colored clothing to be seen. Keep an eye on the weather and leave the water at the first sign of lightning. Avoid alcohol while swimming or engaging in any water activities. Listen to any safety announcements made by lifeguards.", "Rain and moderate waves, stay alert for sudden changes in conditions.": "Always check the weather before entering the water, especially with impending storms. Avoid swimming too far from shore as waves may become unpredictable. If there’s lightning, leave the water immediately and seek shelter. Wear a life jacket if you're engaging in water activities. Be cautious of slippery surfaces and rocks along the shore. Keep a close eye on the sea, as sudden storms can make conditions worse. Be prepared to exit the water quickly if conditions change.", "Strong waves and cloudy skies. Swimming is not recommended.": "Avoid swimming altogether – rough seas can be dangerous, especially for inexperienced swimmers. If you must enter the water, always wear a life jacket. Swim only in designated areas with lifeguards present. Keep a close watch on weather alerts, as conditions can change quickly. Stay away from rocks, piers, or any dangerous underwater structures. If you're in the water, stay calm and swim parallel to the shore if caught in a rip current. Always swim with a buddy and have an emergency exit plan.", "Perfect weather for a beach day, but check conditions regularly.": "Enjoy swimming and water activities but avoid staying too long in the sun. Reapply sunscreen every two hours to avoid sunburn. Drink plenty of water to stay hydrated. Avoid swimming in strong currents or near rocks. Always swim in designated safe areas. Be cautious of sudden changes in weather, especially with storms. Be mindful of any marine life in the area and avoid disturbing them.", "Moderate winds and waves; be cautious and stay near shore.": "Check the weather forecast for any upcoming changes. Use sunscreen with a high SPF, as UV rays can still reach you through clouds. Avoid deep waters if you're not an experienced swimmer. Stay within swimming areas and be cautious around waves. If you're in a group, designate a safe meeting spot in case of emergency. If you're feeling tired, leave the water immediately. Always listen to lifeguard instructions regarding water safety.", "Perfect weather for swimming. Enjoy your day!": "Stay hydrated, especially under the sun. Apply sunscreen to prevent sunburn. Wear a hat or sunglasses for additional sun protection. Always swim in designated areas and be mindful of the currents. Check for any lifeguard instructions or warnings. Avoid alcohol, as it impairs judgment and coordination. Use water shoes to avoid injuries from sharp objects.", "Moderate waves expected, exercise caution while swimming.": "Wear sunscreen and reapply every few hours. Drink plenty of fluids to stay hydrated in the heat. Avoid swimming far from the shore. Stay within the designated swimming areas. Monitor the waves and currents closely; avoid swimming if conditions worsen. Be cautious of rip currents and swim parallel to the shore to escape them. Keep an eye out for lifeguard signals or warnings.", "Nice weather, but stay hydrated. No swimming if feeling weak.": "Hydrate frequently, as you may not feel as thirsty in cloudy weather. Apply sunscreen to avoid unexpected sun exposure. Use polarized sunglasses to reduce glare off the water. Always swim in safe, designated areas. Avoid alcohol while swimming or engaging in any water activities. Stay alert for sudden changes in the weather. Keep a first aid kit on hand, especially if you're prone to small injuries.", "Dangerous conditions due to rain and strong waves. Avoid swimming.": "Avoid swimming altogether – the risk of strong currents and waves is too high. If you're in the water, always wear a life jacket. If a storm is approaching, get out of the water immediately and seek shelter. Be mindful of the risk of hypothermia in cold rain and rough seas. Never swim in rough seas unless you are a trained lifeguard or swimmer. Stay away from rocks or sharp debris in the water. Be aware of sudden changes in sea conditions, as heavy rainfall can intensify the waves.", "Moderate waves, avoid swimming in deep water.": "Stay hydrated, especially in the heat. Avoid swimming in areas with strong currents or large waves. Listen to lifeguard instructions and safety signals. Wear a hat or sunglasses to reduce the risk of sunstroke. Avoid alcohol while swimming or participating in water activities. Keep a first aid kit handy for minor injuries. Be aware of sudden weather changes and be ready to exit the water quickly.", "Avoid swimming in rough seas due to strong waves.": "Avoid swimming entirely if the sea is rough and there are warnings. If you must enter the water, always wear a life jacket. Swim only in areas designated by lifeguards. Be extra cautious with strong rip currents – they can quickly carry you out to deeper waters. Always have a buddy when swimming in rough conditions. Stay away from rocks or other hazardous structures in the water. Keep an eye on weather alerts, and get out of the water if conditions worsen.", "High wave conditions, swimming is not recommended.": "Stay out of the water if waves are too strong. Always swim with a buddy or in designated safe areas. Avoid alcohol and swimming under the influence. Wear a life jacket if you're unsure of your swimming abilities. Keep a watchful eye on the horizon for signs of worsening weather. Make sure to swim parallel to the shore if caught in a rip current. Be aware of your surroundings and stay close to shore if possible."}